# t0 = 10
# t1 = 20
# L = 100
# ro = 1.2
# Cp = 1006.5
# Q = (L * ro * Cp * (t1 - t0)) / 3600
# print(Q)

# Q = k * F * delta_t
# F = a * b
# 1/k = 1/alpha_1 + delta / lambda + 1/alpha_2
# alpha = Nu * lambda / d
# Nu = 0.0023 * Re ** 0.8 * Pr ** 0.4   Pr = 0.74
# Re = ro * v * d / mu

















# Q_приток = Cp * rho * L_приток * (t1_приток - t0_приток) / 3600
# Q_вытяжка = Cp * rho * L_вытяжка * (t0_вытяжка - t1_вытяжка) / 3600

# t1_приток = t0_приток + (t0_вытяжка - t1_вытяжка) * (L_вытяжка / L_приток)


















